app/Http/Controllers/CustomerController.php

select `id`, `name`, `kana`, `tel` from `customers` limit 50 offset 0
select count(*) as aggregate from `customers`
---
    public function index(){
        return Inertia::render('Customers/Index', [
        'customers' => Customer::select('id', 'name', 'kana', 'tel')->paginate(50),
        ]);