app/Http/Controllers/InertiaTestController.php

select * from `inertia_tests`
---
    public function index()
    {
        return Inertia::render('Inertia/Index', [
            'blogs' => InertiaTest::all()
        ]);

select * from `inertia_tests` where `inertia_tests`.`id` = '2' limit 1
select * from `inertia_tests` where `inertia_tests`.`id` = '6' limit 1
---
    public function show($id)
    {
        return Inertia::render('Inertia/Show', [
            'id' => $id,
            'blog' => InertiaTest::findOrFail($id)
        ]);

insert into `inertia_tests` (`title`, `content`, `updated_at`, `created_at`) values ('xxxx', 'cccc', '2025-04-07 10:03:27', '2025-04-07 10:03:27')
---
    public function store(Request $request)
    {
        $request->validate([
            'title' => ['required', 'max:20'],
            'content' => ['required'],
            ]);
        $inertiaTest = new InertiaTest;
        $inertiaTest->title = $request->title;
        $inertiaTest->content = $request->content;
        $inertiaTest->save();