app/Http/Controllers/ItemController.php

    public function index()
    {
        return Inertia::render('Items/Index', [
            'items' => Item::select('id', 'name', 'price', 'is_selling')
            ->get()
        ]);
---
select `id`, `name`, `price`, `is_selling` from `items`

    public function store(StoreItemRequest $request)
    {
        Item::create([
            'name' => $request->name,
            'memo' => $request->memo,
            'price' => $request->price,
        ]);
---
insert into `items` (`name`, `memo`, `price`, `updated_at`, `created_at`) values ('テスト', 'テスト', 1111, '2025-04-22 14:38:20', '2025-04-22 14:38:20')

    public function destroy(Item $item)
    {
        $item->delete();
---
delete from `items` where `id` = 8