app/Http/Controllers/PurchaseController.php

    public function create()
    {
        $customers = Customer::select('id', 'name', 'kana')->get();
        $items = Item::select('id', 'name', 'price')->where('is_selling', true)->get();
---
select `id`, `name`, `kana` from `customers`
select `id`, `name`, `price` from `items` where `is_selling` = 1

    public function store(StorePurchaseRequest $request)
    {
        DB::beginTransaction();

        try {
            // 1. 合計金額を計算
            $total = 0;

            foreach ($request->items as $itemData) {
                logger("attach対象: item_id = {$itemData['id']}, quantity = {$itemData['quantity']}");
                $item = Item::findOrFail($itemData['id']);
                $total += $item->price * $itemData['quantity'];
            }

            // 2. 購入情報を保存
            $purchase = Purchase::create([
                'customer_id' => $request->customer_id,
                'status' => 'new',
                'total_price' => $total,
            ]);

            // 3. 中間テーブルに商品を紐づけ（item_purchase）
            foreach ($request->items as $itemData) {
                $purchase->items()->attach($itemData['id'], [
                    'quantity' => $itemData['quantity'],
                ]);
---
select * from `items` where `items`.`id` = 1 limit 1
insert into `purchases` (`customer_id`, `status`, `total_price`, `updated_at`, `created_at`) values (1, 'new', 31444, '2025-04-23 12:42:18', '2025-04-23 12:42:18')
insert into `item_purchase` (`created_at`, `item_id`, `purchase_id`, `quantity`, `updated_at`) values ('2025-04-23 12:42:18', 1, 101, 1, '2025-04-23 12:42:18')