app/Models/Customer.php

select exists(select * from `customers` where `kana` like 'ササキ%' or `tel` like 'ササキ%') as `exists`
---
    public function scopeSearchCustomers($query, $input = null){
    if(!empty($input)){
    if(Customer::where('kana', 'like', $input . '%' )
    ->orWhere('tel', 'like', $input . '%')->exists()){